artifact/jobs/FSIAJ001-01-ES/datas/trade/output/declaration.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:dec="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ddii/enol/ws/Declaracion.xsd"
                  xmlns:dec1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ddii/enol/ws/DeclaracionInformativa.xsd">
<soapenv:Header/>
<soapenv:Body>
<dec:Declaracion>
<dec1:Cabecera>
  <dec1:TipoComunicacion>A1</dec1:TipoComunicacion>
  <dec1:Modelo>172</dec1:Modelo>
  <dec1:Ejercicio>2023</dec1:Ejercicio>
  <dec1:IDVersionModelo>1.0</dec1:IDVersionModelo>
  <dec1:IDDeclarante>
    <dec1:NIF>A48265169</dec1:NIF>
    <dec1:NombreRazon>BANCO BILBAO VIZCAYA ARGENTARIA S.A.</dec1:NombreRazon>
    <dec1:NIFRepresentante>XXXXXXXX</dec1:NIFRepresentante>
  </dec1:IDDeclarante>
</dec1:Cabecera>
<dec1:Declarado>
  <dec1:IDRegistroDeclarado>123456</dec1:IDRegistroDeclarado>
  <dec1:IDDeclarado>
    <dec1:Clave>T</dec1:Clave>
    <dec1:NombreRazon>John Doe, Jane Smith</dec1:NombreRazon>
    <dec1:Domicilio>
      <dec1:CodigoPais>ES</dec1:CodigoPais>
      <dec1:NombreMunicipio>Madrid</dec1:NombreMunicipio>
      <dec1:NombreVia>Gran Via</dec1:NombreVia>
      <dec1:Numeracion>12</dec1:Numeracion>
      <dec1:CodigoPostal>28013</dec1:CodigoPostal>
    </dec1:Domicilio>
  </dec1:IDDeclarado>
  <dec1:IDMonedas>
    <dec1:TipoMoneda>V</dec1:TipoMoneda>
    <dec1:MonedaVirtual>
      <dec1:TipoMonedaVirtual>
        <dec1:DenominacionMonedaVirtual>BTC/EUR</dec1:DenominacionMonedaVirtual>
        <dec1:SiglasMonedaVirtual>BTC</dec1:SiglasMonedaVirtual>
      </dec1:TipoMonedaVirtual>
      <dec1:NumMonedas>2</dec1:NumMonedas>
      <dec1:ValorMonedas>34950.5</dec1:ValorMonedas>
      <dec1:OrigenValorMonedas>CoinMarketCap</dec1:OrigenValorMonedas>
      <dec1:FechaFinCustodia>2024-01-30</dec1:FechaFinCustodia>
      <dec1:SaldoMonedaVirtual>87450.38</dec1:SaldoMonedaVirtual>
    </dec1:MonedaVirtual>
  </dec1:IDMonedas>
</dec1:Declarado>
<dec1:Declarado>
  <dec1:IDRegistroDeclarado>234567</dec1:IDRegistroDeclarado>
  <dec1:IDDeclarado>
    <dec1:Clave>T</dec1:Clave>
    <dec1:NombreRazon>Alice Johnson</dec1:NombreRazon>
    <dec1:Domicilio>
      <dec1:CodigoPais>ES</dec1:CodigoPais>
      <dec1:NombreMunicipio>Madrid</dec1:NombreMunicipio>
      <dec1:NombreVia>Gran Via</dec1:NombreVia>
      <dec1:Numeracion>12</dec1:Numeracion>
      <dec1:CodigoPostal>28013</dec1:CodigoPostal>
    </dec1:Domicilio>
  </dec1:IDDeclarado>
  <dec1:IDMonedas>
    <dec1:TipoMoneda>V</dec1:TipoMoneda>
    <dec1:MonedaVirtual>
      <dec1:TipoMonedaVirtual>
        <dec1:DenominacionMonedaVirtual>ETH/USD</dec1:DenominacionMonedaVirtual>
        <dec1:SiglasMonedaVirtual>ETH</dec1:SiglasMonedaVirtual>
      </dec1:TipoMonedaVirtual>
      <dec1:NumMonedas>1</dec1:NumMonedas>
      <dec1:ValorMonedas>2160.4</dec1:ValorMonedas>
      <dec1:OrigenValorMonedas>CoinMarketCap</dec1:OrigenValorMonedas>
      <dec1:FechaFinCustodia>2024-01-29</dec1:FechaFinCustodia>
      <dec1:SaldoMonedaVirtual>3920.8</dec1:SaldoMonedaVirtual>
    </dec1:MonedaVirtual>
  </dec1:IDMonedas>
</dec1:Declarado>
</dec:Declaracion>
</soapenv:Body>
</soapenv:Envelope>